In [32]:
import pandas as pd
import os

In [33]:
path = r'C:\Users\anu10\Instacart Basket Analysis'

In [34]:
path

'C:\\Users\\anu10\\Instacart Basket Analysis'

In [35]:
df_ords = pd.read_csv(os.path.join(path, '02 Data\Original Data\orders.csv'),index_col = False)

In [36]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

# Data Wrangling

In [37]:
#Droppind eval_set column from orders.csv
df_ords.drop(columns = ['eval_set'])

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [38]:
df_ords = df_ords.drop(columns = ['eval_set'])

In [39]:
df_ords_2 = df_ords

In [40]:
df_ords['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

In [41]:
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'},inplace = True)

In [42]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [43]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [44]:
df_ords['order_id'].dtype

dtype('int64')

In [45]:
path = r'C:\Users\anu10\Instacart Basket Analysis'

In [46]:
path

'C:\\Users\\anu10\\Instacart Basket Analysis'

In [47]:
#importing data set departments.csv
df_dep = pd.read_csv(os.path.join(path, '02 Data\Original Data\departments.csv'),index_col = False)

In [48]:
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [49]:
# Transposing df_dep.T
df_dep.T

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [50]:
 df_dep_t = df_dep.T

In [51]:
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [52]:
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [53]:
# Take the first row of df_dep_t for the header
new_header = df_dep_t.iloc[0]

In [54]:
new_header

0    department
Name: department_id, dtype: object

In [55]:
df_dep_t_new = df_dep_t[1:]

In [56]:
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [57]:
#Take the data under the header row for a new df
df_dep_t_new = df_dep_t[1:]

In [58]:
df_dep_t_new

                  0
1            frozen
2             other
3            bakery
4           produce
5           alcohol
6     international
7         beverages
8              pets
9   dry goods pasta
10             bulk
11    personal care
12     meat seafood
13           pantry
14        breakfast
15     canned goods
16       dairy eggs
17        household
18           babies
19           snacks
20             deli
21          missing

In [59]:
df_dep_t_new_1

NameError: name 'df_dep_t_new_1' is not defined

In [ ]:
df_dep_t_new.to_csv(os.path.join(path, '02 Data/Prepared Data/departments_wrangled.csv'))

In [ ]:
#set the header row as the df header
df_dep_t_new.columns = new_header

In [ ]:
data_dict = df_dep_t_new.to_dict('index')

In [ ]:
data_dict

In [ ]:
df_prods = pd.read_csv(os.path.join(path, '02 Data\Original Data\products.csv'),index_col = False)

In [ ]:
df_prods.head()

#Subsetting

In [ ]:
print(data_dict.get('19'))

In [ ]:
df_snacks = df_prods[df_prods['department_id']==19]

In [ ]:
df_prods['department_id']==19

In [ ]:
df_prods[df_prods['department_id']==19]

In [ ]:
df_snacks = df_prods[df_prods['department_id']==19]

In [ ]:
df_snacks.head()

In [ ]:
df_snacks_2 = df_snacks

In [ ]:
df_snacks_2 = df_prods.loc[df_prods['department_id']==19]

 # meaning behind value of 4 in the department_id

In [ ]:
df_prods['department_id']==4

In [ ]:
df_produce = df_prods[df_prods['department_id']==4]

In [ ]:
df_produce

department_id 4 meaning is produce name and details. For example, product name,in which aisle product is available, and product price.

# Exporting Dataframe

In [ ]:
#Exporting Dataframes
df_ords.to_csv(os.path.join(path, '02 Data/Prepared Data/orders_wrangled.csv'))

In [ ]:
# 6.Breakfast item sales
print(data_dict.get('14'))

In [ ]:
df_breakfast = df_prods[df_prods['department_id']==14]

In [ ]:
df_breakfast.head()

In [ ]:
df_breakfast_2 = df_breakfast

In [ ]:
df_breakfast_2 = df_prods[df_prods['department_id']==14]

In [ ]:
df_breakfast_2.head()

In [ ]:
# Filtering the dataframe based on selected departments
# 7.df_dinner dataframe


# Filter the DataFrame to include only selected departments
df_dinner_2 = df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

In [ ]:
df_dinner_2 # 7650 rows * 5 columns

In [ ]:
df_dinner_2.head()

In [ ]:
df_ords = df_ords['user_id']==1

In [ ]:
#9.Extract all the information customer with a "user_id" of “1.”  
user_1_data = df_ords[df_ords['user_id'] == 1]

In [ ]:
print(user_1_data)

Details about the user behaviour: Here i have the Data about  Buying product by user, Days of the week with most order,Hours of the day with most order, how frequently user buy product.

In [ ]:
df_prods.shape

In [ ]:
#Exporting products Wrangled
df_prods.to_csv(os.path.join(path, '02 Data/Prepared Data/products_wrangled.csv'))

In [ ]:
df_ords.shape